app/Models/GuerraModel.php

SELECT *
FROM `guerra`
---
    public function getConsequencias()
    {
        $db = \Config\Database::connect();
        return $this->findAll();